app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  	pp @posts = Post.all