app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 1]]
---
	def index
		@photos = Photo.all
		@like = {}
		@photos.each do |photo|
			@votes = Vote.where(photo_id: photo.id).sum(:like)

INSERT INTO "photos" ("user_id", "name", "category_id", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Sticker"], ["category_id", 1], ["created_at", "2017-12-17 09:27:52.860753"], ["updated_at", "2017-12-17 09:27:52.860753"], ["photo", "sticker_375x360-bg_ffffff.u3.png"]]
---
	def create
		params[:photo][:category_id] = params[:category_id]
		params[:photo][:user_id] = current_user.id
		pp @photo = Photo.create(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 1], ["photo_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["like", 1], ["created_at", "2017-12-17 09:27:57.068617"], ["updated_at", "2017-12-17 09:27:57.068617"]]
---
  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil
       @like = 1
       Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)