app/controllers/postcomments_controller.rb

  def create
    params[:postcomment][:post_id] = params[:post_id]
    params[:postcomment][:user_id] = current_user.id
    @comment = Postcomment.create(comment_params)
---
INSERT INTO "postcomments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "Yes, it's me)"], ["post_id", 1], ["user_id", 1], ["created_at", "2017-12-17 09:26:04.272638"], ["updated_at", "2017-12-17 09:26:04.272638"]]

  def set_comment
    pp @comment = Postcomment.find(params[:id])
---
SELECT  "postcomments".* FROM "postcomments" WHERE "postcomments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]