app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Nicky.Mouse"], ["body", "<p>Nicky.Mouse Nicky.Mouse Nicky.Mouse</p>"], ["user_id", 1], ["created_at", "2017-12-17 08:25:06.531082"], ["updated_at", "2017-12-17 08:25:06.531082"]]